<%@ page language="java" contentType="text/html; charset=UTF-8"
	pageEncoding="UTF-8"%>
<div class="hero__search">
	<div class="hero__search__form">
		<form action="#">
			<input type="text" placeholder="푸디 제품, 요리명 등 다양하게 검색해보세요 !"
				id="input-search">
			<button type="button" class="site-btn" onclick="search()">검색</button>
		</form>
	</div>
	<div class="header__icons">
		<div class="header__mypage ml-3 mr-3">
			<a href=<c:url value='/mypage'/>>
				<svg xmlns="http://www.w3.org/2000/svg" id="Layer_1" data-name="Layer 1" viewBox="0 0 24 24" width="32" height="32"><path d="M8.974,12.026c3.323,0,6.026-2.703,6.026-6.026S12.297-.026,8.974-.026,2.949,2.677,2.949,6s2.703,6.026,6.025,6.026ZM8.974,.974c2.771,0,5.026,2.254,5.026,5.026s-2.254,5.026-5.026,5.026S3.949,8.771,3.949,6,6.203,.974,8.974,.974Zm14.293,10.758c-.943-.944-2.592-.944-3.535,0l-8.732,8.732v3.536h3.536l8.732-8.732c.472-.472,.732-1.1,.732-1.768s-.26-1.296-.732-1.768Zm-.707,2.828l-8.439,8.439h-2.122v-2.122l8.439-8.439c.566-.566,1.555-.566,2.121,0,.283,.283,.439,.66,.439,1.061s-.156,.777-.439,1.061Zm-9.061,.439H4.5c-1.93,0-3.5,1.57-3.5,3.5v5.5H0v-5.5c0-2.481,2.019-4.5,4.5-4.5H13.5c.345,0,.684,.046,1.014,.122l-.891,.891c-.042-.001-.081-.013-.123-.013Z"/></svg>
			</a>
		</div>
		<div class="header__wishlist ml-3 mr-3">
			<a href=<c:url value='/wishlist'/>>
				<svg xmlns="http://www.w3.org/2000/svg" id="Layer_1" data-name="Layer 1" viewBox="0 0 24 24" width="32" height="32">
				  <g transform="rotate(180, 12, 12)">
				    <path d="M12.291,1.284l-.291-.208-.291,.208C9.754,2.681,0,9.991,0,16.75c0,3.446,2.804,6.25,6.25,6.25,2.504,0,4.777-1.851,5.75-4.354,.973,2.504,3.246,4.354,5.75,4.354,3.446,0,6.25-2.804,6.25-6.25,0-6.759-9.754-14.069-11.709-15.466Zm5.459,20.716c-2.748,0-5.25-2.86-5.25-6h-1c0,3.14-2.502,6-5.25,6-2.895,0-5.25-2.355-5.25-5.25C1,11.979,6.858,6.043,12,2.307c5.142,3.736,11,9.672,11,14.443,0,2.895-2.355,5.25-5.25,5.25Z"/>
				  </g>
				</svg>		
			</a>
		</div>
		<div class="header__cart ml-3 mr-3">
			<a href=<c:url value='/cart'/>>
				<svg xmlns="http://www.w3.org/2000/svg" id="Layer_1" data-name="Layer 1" viewBox="0 0 24 24" width="32" height="32"><path d="M24,4v1h-8v-1h8ZM9,22c0,1.1-.9,2-2,2s-2-.9-2-2,.9-2,2-2,2,.9,2,2Zm-1,0c0-.55-.45-1-1-1s-1,.45-1,1,.45,1,1,1,1-.45,1-1Zm11,0c0,1.1-.9,2-2,2s-2-.9-2-2,.9-2,2-2,2,.9,2,2Zm-1,0c0-.55-.45-1-1-1s-1,.45-1,1,.45,1,1,1,1-.45,1-1Zm2.94-8H5.88l-1.25-9H13v-1H4.49l-.26-1.84C4.06,.93,3,0,1.76,0H0V1H1.76c.75,0,1.38,.56,1.49,1.29l2.02,14.55c.17,1.23,1.23,2.16,2.48,2.16h12.26v-1H7.74c-.75,0-1.38-.56-1.49-1.29l-.24-1.71h15.74l1.4-7h-1.02l-1.2,6Z"/></svg>
			</a>
		</div>
	</div>
</div>
<script src="<c:url value='/resources/js/search.js' />"></script>
<script src="<c:url value='/resources/js/popup.js' />"></script>